---
type: TemporaryGraphicsCommandData
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# TemporaryGraphicsCommandData

`Autodesk.Revit.UI.TemporaryGraphicsCommandData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Document | 2022 | `public Document Document { get ; internal set ; }` |
| Property | Index | 2022 | `public int Index { get ; internal set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |